{
  "home": "الصفحة الرئيسية",
  "about": "حولنا",
  "gallery": "صالة العرض",
  "offers": "العروض",
  "reviews": "التعليقات",
  "contact": "اتصل بنا",
  "login": "تسجيل الدخول",
  "register": "تسجيل",
  "welcome": "مرحبا بك في",
  "tagline": "عملك المحلي الموثوق به الذي يقدم منتجات وخدمات عالية الجودة مع رعاية عملاء استثنائية.",
  "view_products": "عرض منتجاتنا",
  "contact_us": "اتصل بنا",
  "about_us": "معلومات عنا",
  "about_text": "في بركة ، نحن ملتزمون بتزويد عملائنا بأعلى جودة من المنتجات والخدمات الاستثنائية. يقع في قلب كاستل سان جيوفاني ، ونحن نخدم مجتمعنا لسنوات بتفان ورعاية. يفخر فريقنا بتقديم خدمة شخصية وضمان مغادرة كل عميل راضٍ.",
  "quality_products": "منتجات ذات جودة عالية",
  "quality_text": "نختار كل منتج بعناية لضمان أعلى المعايير.",
  "best_service": "أفضل خدمة",
  "service_text": "فريقنا مكرس لتقديم اهتمام شخصي.",
  "customer_care": "رعاية العميل",
  "care_text": "رضاك هو أولويتنا القصوى.",
  "visit_store": "قم بزيارة متجرنا",
  "address": "عنواننا",
  "open_maps": "افتح في خرائط جوجل",
  "hours": "ساعات العمل",
  "our_gallery": "معرضنا",
  "view_all": "مشاهدة الكل",
  "special_offers": "عروض خاصة",
  "weekly_offers": "عروض أسبوعية",
  "permanent_offers": "عروض دائمة",
  "add_to_cart": "أضف إلى السلة",
  "customer_reviews": "مراجعات العملاء",
  "load_more": "تحميل المزيد من المراجعات",
  "get_in_touch": "ابقى على تواصل",
  "send_message": "أرسل رسالة",
  "name": "الاسم",
  "email": "البريد الإلكتروني",
  "message": "الرسالة",
  "phone": "الهاتف",
  "quick_links": "روابط سريعة",
  "contact_info": "معلومات الاتصال",
  "opening_hours": "ساعات العمل",
  "monday_friday": "الاثنين - الجمعة",
  "saturday": "السبت",
  "sunday": "الأحد",
  "closed": "مغلق",
  "privacy_policy": "سياسة الخصوصية",
  "how_to_use": "كيفية الاستخدام",
  "cookie_policy": "سياسة ملفات الارتباط",
  "terms_conditions": "الشروط والأحكام",
  "dashboard_overview": "نظرة عامة",
  "dashboard_profile": "الملف الشخصي",
  "dashboard_wallet": "محفظة الولاء",
  "dashboard_offers": "عروض خاصة",
  "dashboard_vouchers": "قسائمي",
  "dashboard_loading": "جارٍ تحميل لوحة التحكم...",
  "dashboard_title": "لوحة تحكم العميل",
  "dashboard_sign_out": "تسجيل الخروج",
  "dashboard_welcome": "مرحبًا بعودتك! إليك نظرة عامة على حسابك",
  "dashboard_profile_manage": "إدارة معلوماتك الشخصية وتفضيلاتك",
  "dashboard_wallet_track": "تتبع نقاط الولاء والمكافآت الخاصة بك",
  "dashboard_offers_discover": "اكتشف الصفقات والعروض الترويجية الحصرية",
  "dashboard_vouchers_manage": "إدارة واسترداد قسائمك",
  "privacy_title": "سياسة الخصوصية",
  "privacy_last_updated": "آخر تحديث",
  "privacy_who_we_are_title": "من نحن",
  "privacy_who_we_are_text": "نحن [الاسم القانوني للشركة] (\"نحن\"، \"نا\"، \"خاصتنا\")، مسجلون في [العنوان الكامل]، رقم الشركة/الضريبة [الرقم إن وجد]. يمكنك الاتصال بنا على [البريد الإلكتروني للخصوصية] أو [الهاتف]، أو عن طريق البريد على العنوان أعلاه. إذا تم تعيينه، يمكن الوصول إلى مسؤول حماية البيانات (DPO) لدينا على [البريد الإلكتروني لمسؤول حماية البيانات]. إذا لم نكن مقيمين في الاتحاد الأوروبي، فإن ممثلنا في الاتحاد الأوروبي هو [الاسم، العنوان، البريد الإلكتروني].",
  "privacy_what_policy_covers_title": "ما تغطيه هذه السياسة",
  "privacy_what_policy_covers_text": "توضح هذه السياسة كيف نجمع بياناتك الشخصية ونستخدمها ونشاركها ونخزنها ونؤمنها ونحذفها عند زيارتك أو تسجيلك أو استخدامك [اسم الخدمة] (\"الخدمة\")، وتصف حقوقك بموجب اللائحة العامة لحماية البيانات (GDPR).",
  "privacy_data_we_collect_title": "البيانات التي نجمعها",
  "privacy_data_we_collect_list": [
    "<strong>بيانات التعريف والاتصال:</strong> الاسم الأول، واسم العائلة، والبريد الإلكتروني، والهاتف.",
    "<strong>بيانات الحساب:</strong> كلمة المرور (مخزنة بشكل مجزأ)، وتفضيلات اللغة، وإعدادات الحساب.",
    "<strong>البيانات الديموغرافية وبيانات الملف الشخصي:</strong> تاريخ الميلاد، والإقامة، وبلد المنشأ.",
    "<strong>البيانات الفنية:</strong> عنوان IP، ومعرفات الجهاز، ونوع المتصفح، والصفحات التي تم عرضها، والطوابع الزمنية.",
    "<strong>بيانات ملفات تعريف الارتباط/SDK:</strong> ملفات تعريف الارتباط الضرورية، وبموافقتك، ملفات تعريف الارتباط التحليلية/التسويقية. انظر \"ملفات تعريف الارتباط والتقنيات المماثلة\".",
    "<strong>البيانات الاختيارية</strong> التي تقدمها للدعم أو الاستطلاعات أو طلبات الميزات."
  ],
  "privacy_data_we_collect_text": "لا تقدم فئات خاصة من البيانات (مثل الصحة والقياسات الحيوية والآراء السياسية) ما لم يُطلب منك ذلك على وجه التحديد ويبرره القانون؛ وإلا فلن نعالجها عن علم.",
  "privacy_why_we_process_data_title": "لماذا نعالج بياناتك",
  "privacy_why_we_process_data_text": "نقوم بمعالجة البيانات الشخصية فقط عند وجود أساس قانوني صالح:",
  "privacy_why_we_process_data_list": [
    "<strong>إنشاء الحساب وإدارته:</strong> لتسجيلك ومصادقتك وتقديم الخدمة (عقد).",
    "<strong>تشغيل الخدمة وأمنها:</strong> للتشغيل والصيانة واستكشاف الأخطاء وإصلاحها ومنع الاحتيال/إساءة الاستخدام (المصالح المشروعة؛ عند الحاجة، الالتزام القانوني).",
    "<strong>الاتصالات:</strong> رسائل البريد الإلكتروني الخاصة بالخدمة حول التغييرات أو الأمان أو إشعارات الحساب (عقد/التزام قانوني)؛ التسويق الاختياري بموافقتك وخيار إلغاء الاشتراك.",
    "<strong>التحليلات والتحسين:</strong> لفهم الاستخدام وتحسين الأداء والميزات (المصالح المشروعة؛ ملفات تعريف الارتباط التحليلية فقط بموافقتك).",
    "<strong>الامتثال:</strong> للوفاء بالالتزامات القانونية (الضرائب والمحاسبة والطلبات التنظيمية) وفرض الشروط وحماية الحقوق."
  ],
  "privacy_why_we_process_data_text2": "عندما نعتمد على المصالح المشروعة، فإننا نوازن بين مصالحنا وحقوقك وحرياتك ويمكننا تقديم تفاصيل عند الطلب. يمكنك الاعتراض على المعالجة بناءً على المصالح المشروعة.",
  "privacy_when_you_must_provide_data_title": "إذا كان يجب عليك تقديم البيانات",
  "privacy_when_you_must_provide_data_text": "عندما تكون البيانات ضرورية لإنشاء حساب أو تقديم الخدمة، فإن عدم تقديمها قد يمنع التسجيل أو الوصول. يتم تمييز الحقول الإلزامية عند التسجيل.",
  "privacy_who_receives_your_data_title": "من يتلقى بياناتك",
  "privacy_who_receives_your_data_text": "نحن نشارك البيانات فقط عند الضرورة:",
  "privacy_who_receives_your_data_list": [
    "<strong>مقدمو الخدمات (المعالجون):</strong> الاستضافة والتحليلات ودعم العملاء والاتصالات والمدفوعات. يعملون بناءً على تعليماتنا وبموجب اتفاقيات حماية البيانات.",
    "<strong>الشؤون القانونية والامتثال:</strong> السلطات أو الأطراف الثالثة عند الاقتضاء بموجب القانون أو لحماية الحقوق والسلامة.",
    "<strong>نقل الأعمال:</strong> في حالة الاندماج أو الاستحواذ أو بيع الأصول، مع مراعاة الضمانات والإشعار."
  ],
  "privacy_who_receives_your_data_text2": "نحن لا نبيع بياناتك الشخصية.",
  "privacy_international_data_transfers_title": "نقل البيانات الدولي",
  "privacy_international_data_transfers_text": "إذا قمنا بنقل بياناتك خارج المنطقة الاقتصادية الأوروبية/المملكة المتحدة، فإننا نستخدم ضمانات معتمدة مثل قرارات الملاءمة الصادرة عن المفوضية الأوروبية أو البنود التعاقدية القياسية، وعند الاقتضاء، تدابير تكميلية. يمكنك طلب نسخة من الضمانات ذات الصلة.",
  "privacy_data_retention_title": "كم من الوقت نحتفظ ببياناتك",
  "privacy_data_retention_text": "نحتفظ بالبيانات الشخصية فقط طالما كان ذلك ضروريًا للأغراض الواردة في هذه السياسة:",
  "privacy_data_retention_list": [
    "<strong>بيانات الحساب:</strong> طوال عمر حسابك ولفترة معقولة بعد ذلك لحفظ السجلات والأمان والالتزامات القانونية.",
    "<strong>سجلات المعاملات/الفنية:</strong> لفترات أقصر تتماشى مع احتياجات الأمان والتدقيق."
  ],
  "privacy_data_retention_text2": "نطبق معايير مثل فترات التقادم القانوني والمتطلبات التنظيمية والاحتياجات التشغيلية. عندما لا تعود هناك حاجة إليها، نقوم بحذف البيانات أو إخفاء هويتها بشكل لا رجعة فيه.",
  "privacy_privacy_rights_title": "حقوق الخصوصية الخاصة بك",
  "privacy_privacy_rights_text": "بموجب اللائحة العامة لحماية البيانات، لديك:",
  "privacy_privacy_rights_list": [
    "<strong>الحق في الوصول:</strong> الحصول على نسخة من بياناتك الشخصية.",
    "<strong>الحق في التصحيح:</strong> تصحيح البيانات غير الدقيقة أو غير المكتملة.",
    "<strong>الحق في الحذف:</strong> طلب الحذف في حالات معينة (على سبيل المثال، سحب الموافقة، لم تعد هناك حاجة إليها).",
    "<strong>الحق في التقييد:</strong> تقييد المعالجة في ظروف محددة.",
    "<strong>الحق في قابلية النقل:</strong> استلام بياناتك بتنسيق قابل للقراءة آليًا ونقلها إلى وحدة تحكم أخرى حيثما أمكن ذلك تقنيًا.",
    "<strong>الحق في الاعتراض:</strong> الاعتراض على المعالجة بناءً على المصالح المشروعة أو التسويق المباشر.",
    "<strong>الحقوق المتعلقة باتخاذ القرارات الآلية:</strong> طلب المراجعة البشرية والاعتراض على القرارات عند الاقتضاء."
  ],
  "privacy_privacy_rights_text2": "لممارسة هذه الحقوق، اتصل بنا على [البريد الإلكتروني للخصوصية]. قد نحتاج إلى التحقق من هويتك. لديك أيضًا الحق في تقديم شكوى إلى السلطة الإشرافية المحلية.",
  "privacy_consent_withdrawal_title": "الموافقة والسحب",
  "privacy_consent_withdrawal_text": "عندما تعتمد المعالجة على موافقتك (على سبيل المثال، ملفات تعريف الارتباط التسويقية أو غير الأساسية)، يمكنك سحب الموافقة في أي وقت عبر إعدادات الحساب أو لافتة ملفات تعريف الارتباط أو روابط إلغاء الاشتراك أو عن طريق الاتصال بنا، دون التأثير على المعالجة قبل السحب.",
  "privacy_cookies_title": "ملفات تعريف الارتباط والتقنيات المماثلة",
  "privacy_cookies_text": "نحن نستخدم:",
  "privacy_cookies_list": [
    "<strong>ملفات تعريف الارتباط الضرورية للغاية:</strong> مطلوبة لتسجيل الدخول والأمان والوظائف الأساسية (لا يلزم الحصول على موافقة).",
    "<strong>بموافقتك:</strong> ملفات تعريف الارتباط التحليلية، وإذا تم استخدامها، ملفات تعريف الارتباط التسويقية. يمكنك إدارة التفضيلات في لافتة ملفات تعريف الارتباط أو إعدادات المتصفح في أي وقت."
  ],
  "privacy_cookies_text2": "انظر سياسة ملفات تعريف الارتباط الخاصة بنا للحصول على تفاصيل حول الفئات والأغراض وفترات الصلاحية والموفرين.",
  "privacy_children_data_title": "بيانات الأطفال",
  "privacy_children_data_text": "خدمتنا غير موجهة للأطفال دون السن المطلوب بموجب القانون المحلي. إذا علمنا أننا قمنا بمعالجة بيانات طفل دون موافقة مناسبة، فسنحذفها. تنطبق التزامات موافقة الوالدين الإضافية على موافقة الأطفال في بعض الولايات القضائية.",
  "privacy_security_title": "الأمان",
  "privacy_security_text": "ننفذ تدابير فنية وتنظيمية مناسبة لحماية البيانات الشخصية، بما في ذلك التشفير أثناء النقل وضوابط الوصول وممارسات التطوير الآمنة والعناية الواجبة بالموردين. لا يوجد نظام آمن بنسبة 100٪؛ نحافظ على الضمانات ونحسنها بمرور الوقت.",
  "privacy_automated_decision_making_title": "اتخاذ القرارات الآلية",
  "privacy_automated_decision_making_text": "نحن لا نستخدم اتخاذ القرارات الآلية التي تنتج آثارًا قانونية أو ذات أهمية مماثلة دون ضمانات مناسبة. إذا قدمنا مثل هذه المعالجة، فسنقدم الإشعارات المطلوبة ونمكن حقوقك.",
  "privacy_third_party_sites_title": "مواقع الأطراف الثالثة",
  "privacy_third_party_sites_text": "قد ترتبط الخدمة بمواقع أو خدمات أطراف ثالثة. تخضع ممارسات الخصوصية الخاصة بها لسياساتها الخاصة؛ راجعها قبل تقديم البيانات.",
  "privacy_changes_to_policy_title": "التغييرات على هذه السياسة",
  "privacy_changes_to_policy_text": "قد نقوم بتحديث هذه السياسة لتعكس التغييرات في القانون أو التكنولوجيا أو ممارساتنا. سنقوم بتحديث تاريخ \"آخر تحديث\"، وعند الاقتضاء، سنقدم إشعارًا بارزًا أو نطلب موافقة متجددة.",
  "privacy_contact_complaints_title": "الاتصال والشكاوى",
  "privacy_contact_complaints_text": "الأسئلة أو الطلبات: [البريد الإلكتروني للخصوصية]، [العنوان البريدي]، [الهاتف]. لديك الحق في تقديم شكوى إلى هيئة حماية البيانات، مثل الهيئة في مكان إقامتك المعتاد أو مكان عملك أو مكان الانتهاك المزعوم."
}
