{
  "home": "Home",
  "about": "About",
  "gallery": "Gallery",
  "offers": "Offers",
  "reviews": "Reviews",
  "contact": "Contact",
  "login": "Login",
  "register": "Register",
  "welcome": "Welcome to",
  "tagline": "Your trusted local business offering quality products and services with exceptional customer care.",
  "view_products": "View Our Products",
  "contact_us": "Contact Us",
  "about_us": "About Us",
  "about_text": "At Baraka, we are committed to providing our customers with the highest quality products and exceptional service. Located in the heart of Castel San Giovanni, we have been serving our community for years with dedication and care. Our team takes pride in offering personalized service and ensuring every customer leaves satisfied.",
  "quality_products": "Quality Products",
  "quality_text": "We carefully select each product to ensure the highest standards.",
  "best_service": "Best Service",
  "service_text": "Our team is dedicated to providing personalized attention.",
  "customer_care": "Customer Care",
  "care_text": "Your satisfaction is our top priority.",
  "visit_store": "Visit Our Store",
  "address": "Our Address",
  "open_maps": "Open in Google Maps",
  "hours": "Opening Hours",
  "our_gallery": "Our Gallery",
  "view_all": "View All",
  "special_offers": "Special Offers",
  "weekly_offers": "Weekly Offers",
  "permanent_offers": "Permanent Offers",
  "add_to_cart": "Add to Cart",
  "customer_reviews": "Customer Reviews",
  "load_more": "Load More Reviews",
  "get_in_touch": "Get in Touch",
  "send_message": "Send Message",
  "name": "Name",
  "email": "Email",
  "message": "Message",
  "phone": "Phone",
  "quick_links": "Quick Links",
  "contact_info": "Contact Info",
  "opening_hours": "Opening Hours",
  "monday_friday": "Monday - Friday",
  "saturday": "Saturday",
  "sunday": "Sunday",
  "closed": "Closed",
  "privacy_policy": "Privacy Policy",
  "how_to_use": "How to Use",
  "cookie_policy": "Cookie Policy",
  "terms_conditions": "Terms & Conditions",
  "dashboard_overview": "Overview",
  "dashboard_profile": "Profile",
  "dashboard_wallet": "Loyalty Wallet",
  "dashboard_offers": "Special Offers",
  "dashboard_vouchers": "My Vouchers",
  "dashboard_loading": "Loading dashboard...",
  "dashboard_title": "Customer Dashboard",
  "dashboard_sign_out": "Sign Out",
  "dashboard_welcome": "Welcome back! Here's an overview of your account",
  "dashboard_profile_manage": "Manage your personal information and preferences",
  "dashboard_wallet_track": "Track your loyalty points and rewards",
  "dashboard_offers_discover": "Discover exclusive deals and promotions",
  "dashboard_vouchers_manage": "Manage and redeem your vouchers",
  "privacy_title": "Privacy Policy",
  "privacy_last_updated": "Last updated",
  "privacy_who_we_are_title": "Who We Are",
  "privacy_who_we_are_text": "We are [Legal Company Name] (\"we\", \"us\", \"our\"), registered at [Full Address], company/tax number [Number if applicable]. You can contact us at [privacy email] or [phone], or by post to the address above. If appointed, our Data Protection Officer (DPO) can be reached at [DPO email]. If we are not established in the EU, our EU Representative is [Name, Address, Email].",
  "privacy_what_policy_covers_title": "What This Policy Covers",
  "privacy_what_policy_covers_text": "This policy explains how we collect, use, share, store, secure, and delete your personal data when you visit, register, or use [Service Name] (the \"Service\"), and describes your rights under the GDPR.",
  "privacy_data_we_collect_title": "The Data We Collect",
  "privacy_data_we_collect_list": [
    "<strong>Identification and contact data:</strong> first name, last name, email, phone.",
    "<strong>Account data:</strong> password (stored hashed), language preferences, account settings.",
    "<strong>Demographic and profile data:</strong> date of birth, residence, country of origin.",
    "<strong>Technical data:</strong> IP address, device identifiers, browser type, pages viewed, and timestamps.",
    "<strong>Cookies/SDK data:</strong> necessary and, with consent, analytics/marketing cookies. See \"Cookies and similar technologies.\"",
    "<strong>Optional data</strong> you provide to support, surveys, or feature requests."
  ],
  "privacy_data_we_collect_text": "Do not provide special categories of data (e.g., health, biometric, political opinions) unless specifically requested and lawfully justified; otherwise we will not knowingly process them.",
  "privacy_why_we_process_data_title": "Why We Process Your Data",
  "privacy_why_we_process_data_text": "We process personal data only where a valid legal basis applies:",
  "privacy_why_we_process_data_list": [
    "<strong>Account creation and administration:</strong> to register you, authenticate you, and provide the Service (contract).",
    "<strong>Service operation and security:</strong> to operate, maintain, troubleshoot, prevent fraud/abuse (legitimate interests; where needed, legal obligation).",
    "<strong>Communications:</strong> service emails about changes, security, or account notices (contract/legal obligation); optional marketing with your consent and an opt‑out.",
    "<strong>Analytics and improvement:</strong> to understand usage, improve performance and features (legitimate interests; analytics cookies only with consent).",
    "<strong>Compliance:</strong> to meet legal obligations (tax, accounting, regulatory requests), enforce terms, protect rights."
  ],
  "privacy_why_we_process_data_text2": "Where we rely on legitimate interests, we balance our interests against your rights and freedoms and can provide details upon request. You may object to processing based on legitimate interests.",
  "privacy_when_you_must_provide_data_title": "If You Must Provide Data",
  "privacy_when_you_must_provide_data_text": "Where data are necessary to create an account or provide the Service, failure to provide them may prevent registration or access. Mandatory fields are marked at registration.",
  "privacy_who_receives_your_data_title": "Who Receives Your Data",
  "privacy_who_receives_your_data_text": "We share data only as needed:",
  "privacy_who_receives_your_data_list": [
    "<strong>Service providers (processors):</strong> hosting, analytics, customer support, communications, payments. They act on our instructions and under data protection agreements.",
    "<strong>Legal and compliance:</strong> authorities or third parties when required by law or to protect rights and safety.",
    "<strong>Business transfers:</strong> in a merger, acquisition, or asset sale, subject to safeguards and notice."
  ],
  "privacy_who_receives_your_data_text2": "We do not sell your personal data.",
  "privacy_international_data_transfers_title": "International Data Transfers",
  "privacy_international_data_transfers_text": "If we transfer your data outside the EEA/UK, we use approved safeguards such as European Commission adequacy decisions or Standard Contractual Clauses, and, where needed, supplementary measures. You can request a copy of relevant safeguards.",
  "privacy_data_retention_title": "How Long We Keep Your Data",
  "privacy_data_retention_text": "We keep personal data only as long as necessary for the purposes in this policy:",
  "privacy_data_retention_list": [
    "<strong>Account data:</strong> for the life of your account and a reasonable period thereafter for record‑keeping, security, and legal obligations.",
    "<strong>Transactional/technical logs:</strong> for shorter periods aligned with security and audit needs."
  ],
  "privacy_data_retention_text2": "We apply criteria such as legal limitation periods, regulatory requirements, and operational needs. When no longer needed, we delete or irreversibly anonymize data.",
  "privacy_privacy_rights_title": "Your Privacy Rights",
  "privacy_privacy_rights_text": "Under the GDPR, you have:",
  "privacy_privacy_rights_list": [
    "<strong>Right of access:</strong> get a copy of your personal data.",
    "<strong>Right to rectification:</strong> correct inaccurate or incomplete data.",
    "<strong>Right to erasure:</strong> request deletion in certain cases (e.g., consent withdrawal, no longer needed).",
    "<strong>Right to restriction:</strong> limit processing in specific circumstances.",
    "<strong>Right to portability:</strong> receive your data in a machine‑readable format and have it transmitted to another controller where technically feasible.",
    "<strong>Right to object:</strong> object to processing based on legitimate interests or direct marketing.",
    "<strong>Rights related to automated decision‑making:</strong> request human review and contest decisions where applicable."
  ],
  "privacy_privacy_rights_text2": "To exercise these rights, contact us at [privacy email]. We may need to verify your identity. You also have the right to lodge a complaint with your local supervisory authority.",
  "privacy_consent_withdrawal_title": "Consent and Withdrawal",
  "privacy_consent_withdrawal_text": "Where processing relies on your consent (e.g., marketing or non‑essential cookies), you may withdraw consent at any time via account settings, cookie banner, unsubscribe links, or by contacting us, without affecting processing before withdrawal.",
  "privacy_cookies_title": "Cookies and Similar Technologies",
  "privacy_cookies_text": "We use:",
  "privacy_cookies_list": [
    "<strong>Strictly necessary cookies:</strong> required for login, security, and core functions (no consent needed).",
    "<strong>With your consent:</strong> analytics and, if used, marketing cookies. You can manage preferences in the cookie banner or browser settings at any time."
  ],
  "privacy_cookies_text2": "See our Cookie Policy for details on categories, purposes, lifetimes, and providers.",
  "privacy_children_data_title": "Children's Data",
  "privacy_children_data_text": "Our Service is not directed to children under the age required by local law. If we learn we processed a child's data without appropriate consent, we will delete it. Additional parental consent obligations apply for children's consent in some jurisdictions.",
  "privacy_security_title": "Security",
  "privacy_security_text": "We implement appropriate technical and organizational measures to protect personal data, including encryption in transit, access controls, secure development practices, and vendor due diligence. No system is 100% secure; we maintain and improve safeguards over time.",
  "privacy_automated_decision_making_title": "Automated Decision-Making",
  "privacy_automated_decision_making_text": "We do not use automated decision-making that produces legal or similarly significant effects without appropriate safeguards. If we introduce such processing, we will provide required notices and enable your rights.",
  "privacy_third_party_sites_title": "Third-Party Sites",
  "privacy_third_party_sites_text": "The Service may link to third-party websites or services. Their privacy practices are governed by their own policies; review them before providing data.",
  "privacy_changes_to_policy_title": "Changes to This Policy",
  "privacy_changes_to_policy_text": "We may update this policy to reflect changes in law, technology, or our practices. We will update the \"Last updated\" date and, where required, provide prominent notice or request renewed consent.",
  "privacy_contact_complaints_title": "Contact and Complaints",
  "privacy_contact_complaints_text": "Questions or requests: [privacy email], [postal address], [phone]. You have the right to lodge a complaint with a data protection authority, such as the authority in your habitual residence, place of work, or place of the alleged infringement.",
  "cookies_title": "Cookie Policy",
  "cookies_placeholder": "This is a placeholder for the Cookie Policy.",
  "terms_title": "Terms and Conditions",
  "terms_last_updated": "Last updated",
  "terms_about_us_title": "About Us",
  "terms_about_us_text": "These Terms and Conditions govern your use of [Service Name] operated by [Legal Company Name], registered at [Full Address], company/tax number [Number if applicable]. Contact: [support email] and [phone number]. By accessing or registering, you agree to these Terms.",
  "terms_definitions_title": "Definitions",
  "terms_definitions_list": [
    "<strong>\"Service\"</strong> means the [website/app name], related features, and content we provide.",
    "<strong>\"User,\" \"you,\" or \"your\"</strong> means any person who visits, registers, or uses the Service.",
    "<strong>\"Content\"</strong> means text, images, data, or materials displayed on or transmitted via the Service."
  ],
  "terms_eligibility_title": "Eligibility and Account Registration",
  "terms_eligibility_text": "You must be the legal age of majority in your country of residence, or have valid parental consent if permitted by law. You agree to provide accurate, complete information and to keep your login credentials confidential. You are responsible for all activity under your account and must promptly notify us of any suspected unauthorized use or security breach. We may suspend or terminate accounts that violate these Terms.",
  "terms_service_description_title": "Service Description and Changes",
  "terms_service_description_text": "We provide fast registration, secure storage, and a personal account area with features that may change over time. We may add, modify, or discontinue features or the Service (in whole or part). We aim to avoid disruptions but cannot guarantee continuous availability.",
  "terms_acceptable_use_title": "Acceptable Use",
  "terms_acceptable_use_text": "You agree not to:",
  "terms_acceptable_use_list": [
    "Break any applicable laws or regulations.",
    "Attempt unauthorized access, probe or bypass security, or interfere with the Service.",
    "Post or transmit unlawful, abusive, infringing, deceptive, or harmful content.",
    "Harvest or collect others' data without their explicit consent."
  ],
  "terms_acceptable_use_text2": "We may remove violating content and suspend or terminate access for breaches.",
  "terms_user_content_title": "User Content and License",
  "terms_user_content_text": "You retain ownership of your content. You grant us a non‑exclusive, worldwide license to host, store, reproduce, and display your content solely to operate and improve the Service. We do not claim ownership of your content and will process removal requests in line with applicable law.",
  "terms_intellectual_property_title": "Intellectual Property",
  "terms_intellectual_property_text": "The Service, including software, design, brand, and all associated intellectual property, is owned by or licensed to us. You may not copy, modify, distribute, reverse engineer, or create derivative works unless permitted by law or with our prior written consent.",
  "terms_third_party_links_title": "Third-Party Links and Services",
  "terms_third_party_links_text": "The Service may link to or integrate with third‑party sites or services. We are not responsible for any third‑party content, policies, or practices; use of such resources is at your own risk.",
  "terms_pricing_title": "Pricing and Payments (if applicable)",
  "terms_pricing_text": "If any paid features apply, pricing and payment terms will be shown clearly before purchase. Accepted payment methods, billing cycles, taxes, and any additional fees will be disclosed. Subscription terms (renewal, cancellation, proration) will be stated at checkout and in your account.",
  "terms_shipping_returns_title": "Shipping, Returns, and Refunds (if selling goods)",
  "terms_shipping_returns_list": [
    "<strong>Shipping:</strong> regions served, delivery estimates, and costs.",
    "<strong>Returns:</strong> return window, condition requirements, and process.",
    "<strong>Refunds:</strong> eligibility, timeline, and method."
  ],
  "terms_shipping_returns_text2": "Mandatory consumer rights apply and prevail over conflicting terms.",
  "terms_consumer_rights_title": "Consumer Rights and Withdrawal",
  "terms_consumer_rights_text": "For distance contracts with EU consumers, you may have a 14‑day right of withdrawal under national laws implementing EU rules, subject to legal exceptions (e.g., after starting delivery of digital content/services with your express consent and acknowledgment of losing the withdrawal right). These Terms do not affect your mandatory consumer rights. Any unfair term that creates a significant imbalance to the detriment of the consumer is not binding. We outline how to cancel, what happens on cancellation, and any fair, pre‑disclosed costs.",
  "terms_disclaimers_title": "Disclaimers and Limitation of Liability",
  "terms_disclaimers_text": "The Service is provided \"as is\" and \"as available,\" without warranties of any kind (express or implied) to the maximum extent permitted by law, including non‑infringement, merchantability, and fitness for a particular purpose. To the fullest extent permitted by law, we are not liable for indirect, incidental, special, consequential, or punitive damages, or loss of profits, data, or goodwill arising from or related to your use of the Service. Nothing in these Terms excludes or limits liability where it would be unlawful to do so (for example, liability for death or personal injury caused by negligence).",
  "terms_indemnification_title": "Indemnification",
  "terms_indemnification_text": "You agree to indemnify and hold us harmless from claims, losses, liabilities, damages, and costs (including reasonable legal fees) arising from your breach of these Terms or misuse of the Service, to the extent permitted by law.",
  "terms_site_management_title": "Site Management and Support",
  "terms_site_management_text": "We may monitor compliance, remove or disable access to content, manage the Service to protect its integrity, and perform maintenance. Support is available via the channels stated on the Service or in these Terms.",
  "terms_suspension_termination_title": "Suspension and Termination",
  "terms_suspension_termination_text": "We may suspend or terminate your account immediately if you breach these Terms, misuse the Service, or where legally or technically required. You may close your account at any time through your settings or by contacting us. Sections intended to survive termination (e.g., IP, disclaimers, liability limits) will continue to apply.",
  "terms_privacy_protection_title": "Privacy and Data Protection",
  "terms_privacy_protection_text": "Your personal data is processed in accordance with our Privacy Policy, which explains legal bases, purposes, retention periods, transfers, and your rights under the GDPR. By using the Service, you agree to comply with the Privacy Policy; where consent is the legal basis, you can withdraw it at any time without affecting prior processing.",
  "terms_governing_law_title": "Governing Law and Jurisdiction",
  "terms_governing_law_text": "These Terms are governed by the laws of [Member State], without prejudice to mandatory consumer protection provisions of your country of residence if you are an EU consumer. Disputes will be subject to the non‑exclusive jurisdiction of the courts of [City, Country].",
  "terms_changes_terms_title": "Changes to These Terms",
  "terms_changes_terms_text": "We may update these Terms to reflect legal, technical, or business changes. We will indicate the \"Last updated\" date and, where required, provide reasonable notice or request renewed consent. Continued use after changes constitutes acceptance.",
  "terms_contact_title": "Contact",
  "terms_contact_text": "Questions about these Terms can be sent to: [Company Name], [Address], [support email], [phone].",
  "how_to_use_title": "How to Use Baraka Platform",
  "how_to_use_description": "A comprehensive guide to understanding and using the Baraka Customer Loyalty Platform for both administrators and customers",
  "how_to_use_overview": "Overview",
  "how_to_use_admin_guide": "Admin Guide",
  "how_to_use_customer_guide": "Customer Guide",
  "how_to_use_platform_overview": "Platform Overview",
  "how_to_use_what_is_baraka": "What is Baraka Platform?",
  "how_to_use_what_is_baraka_text": "Baraka is a comprehensive customer loyalty platform designed for physical retail shops. It combines a public website, customer registration system, customer dashboard, admin dashboard, and a loyalty points system with WhatsApp Business API integration for messaging.",
  "how_to_use_what_is_baraka_text2": "Our platform helps businesses build stronger relationships with their customers through personalized loyalty programs, targeted communications, and seamless shopping experiences.",
  "how_to_use_why_use_baraka": "Why Use Baraka Platform?",
  "how_to_use_build_loyalty": "Build Customer Loyalty",
  "how_to_use_build_loyalty_text": "Create a points-based rewards system that keeps customers coming back to your store.",
  "how_to_use_increase_engagement": "Increase Engagement",
  "how_to_use_increase_engagement_text": "Send personalized offers and targeted communications to engage customers effectively.",
  "how_to_use_manage_information": "Manage Information",
  "how_to_use_manage_information_text": "Easily manage customer information and track their interactions for better service.",
  "how_to_use_whatsapp_integration": "WhatsApp Integration",
  "how_to_use_multi_language": "Multi-language Support",
  "how_to_use_gdpr": "GDPR Compliance",
  "how_to_use_real_time_analytics": "Real-time Analytics",
  "how_to_use_when_to_use": "When to Use Baraka Platform?",
  "how_to_use_for_business_owners": "For Business Owners",
  "how_to_use_for_business_owners_list": [
    "Launching a new retail business",
    "Looking to increase customer retention",
    "Wanting to gather customer data for marketing",
    "Needing to manage customer communications",
    "Expanding to serve diverse linguistic communities"
  ],
  "how_to_use_for_customers": "For Customers",
  "how_to_use_for_customers_list": [
    "Joining loyalty programs for rewards",
    "Tracking points and rewards",
    "Receiving personalized offers",
    "Managing personal information securely",
    "Communicating with the business"
  ],
  "how_to_use_how_it_works": "How Does It Work?",
  "how_to_use_customer_registration": "Customer Registration",
  "how_to_use_customer_registration_text": "Customers register with personal information and consent to data processing",
  "how_to_use_loyalty_points": "Loyalty Points",
  "how_to_use_loyalty_points_text": "Customers earn points based on purchases which can be redeemed for rewards",
  "how_to_use_admin_management": "Admin Management",
  "how_to_use_admin_management_text": "Admins manage customers, offers, points, and send targeted communications",
  "how_to_use_admin_dashboard_overview": "Admin Dashboard Overview",
  "how_to_use_admin_dashboard_overview_text": "The admin dashboard is the central hub for managing your customer loyalty program. As a store manager, you have access to all aspects of the platform including customer management, offer creation, points tracking, and communication tools.",
  "how_to_use_admin_dashboard_overview_text2": "All actions in the admin panel are secured with authentication and audit-logged to ensure data integrity and compliance with GDPR regulations.",
  "how_to_use_key_admin_features": "Key Admin Features",
  "how_to_use_customer_management": "Customer Management",
  "how_to_use_customer_management_list": [
    "View all registered customers",
    "Filter by name, country of origin, or residence",
    "Add new customers (if needed)",
    "Edit customer information",
    "View customer history and engagement"
  ],
  "how_to_use_loyalty_points_system": "Loyalty Points System",
  "how_to_use_loyalty_points_system_list": [
    "Add points to customer accounts",
    "Deduct points as needed",
    "View complete points history",
    "Configure points calculation formula",
    "Convert points to vouchers"
  ],
  "how_to_use_offers_management": "Offers Management",
  "how_to_use_offers_management_list": [
    "Create weekly offers",
    "Set up permanent offers",
    "Configure multi-language descriptions",
    "Set visibility periods for offers",
    "Target offers to specific customer groups"
  ],
  "how_to_use_reviews_communications": "Reviews & Communications",
  "how_to_use_reviews_communications_list": [
    "Moderate customer reviews",
    "Approve or hide reviews",
    "Send WhatsApp campaigns",
    "Send birthday messages",
    "Target messages by nationality"
  ],
  "how_to_use_how_to_manage_customers": "How to Manage Customers",
  "how_to_use_how_to_manage_customers_list": [
    "Navigate to the \"Customers\" section in the admin dashboard",
    "View the complete list of registered customers with their details",
    "Use filters to search for specific customers by name, country, or residence",
    "Click on a customer to view their profile, points history, and purchase history",
    "Update customer information as needed",
    "If necessary, add or deduct loyalty points to their account"
  ],
  "how_to_use_how_to_process_loyalty_points": "How to Process Loyalty Points",
  "how_to_use_adding_points": "Adding Points",
  "how_to_use_adding_points_list": [
    "Go to the \"Points\" section in the admin dashboard",
    "Select \"Add Points\" option",
    "Search and select the customer",
    "Enter the purchase amount (default formula: €1 = 1 point)",
    "Confirm the transaction",
    "Points will be added to the customer's account immediately"
  ],
  "how_to_use_converting_to_vouchers": "Converting to Vouchers",
  "how_to_use_converting_to_vouchers_list": [
    "Access the customer's loyalty wallet",
    "Click on \"Create Voucher\" option",
    "Specify the point value to convert",
    "System generates a unique voucher code",
    "Share the voucher with the customer",
    "Track voucher usage in the system"
  ],
  "how_to_use_sending_whatsapp_messages": "Sending WhatsApp Messages",
  "how_to_use_sending_whatsapp_messages_text": "The platform integrates with WhatsApp Business API to enable direct communication with customers.",
  "how_to_use_sending_whatsapp_messages_list": [
    "Navigate to the \"Campaigns\" section in the admin dashboard",
    "Select the type of message (Promotional, Birthday, Nationality-targeted)",
    "Choose the target customer group using filters",
    "Select from approved WhatsApp templates",
    "Customize the message content as needed",
    "Send the message and monitor delivery status in the logs"
  ],
  "how_to_use_sending_whatsapp_messages_text2": "All messages must use pre-approved templates to comply with WhatsApp Business API policies.",
  "how_to_use_getting_started": "Getting Started",
  "how_to_use_getting_started_text": "The Baraka customer loyalty platform is designed to be simple and intuitive for all users. Whether you're new to the platform or a returning customer, this guide will help you make the most of your loyalty rewards.",
  "how_to_use_getting_started_text2": "Our platform supports multiple languages (Italian, English, French, Spanish, and Arabic) to serve diverse communities. You can switch languages using the translator widget.",
  "how_to_use_how_to_register": "How to Register",
  "how_to_use_required_information": "Required Information",
  "how_to_use_required_information_list": [
    "First name and last name",
    "Date of birth",
    "Residence address",
    "Phone number",
    "Email address",
    "Country of origin",
    "GDPR consent confirmation"
  ],
  "how_to_use_registration_steps": "Registration Steps",
  "how_to_use_registration_steps_list": [
    "Click \"Register\" button on the homepage",
    "Fill in all required information",
    "Agree to GDPR consent requirements",
    "Submit your registration form",
    "Check your email or WhatsApp for confirmation",
    "Log in to your new account"
  ],
  "how_to_use_using_your_dashboard": "Using Your Customer Dashboard",
  "how_to_use_using_your_dashboard_text": "Once logged in, your customer dashboard becomes your central hub for managing your loyalty rewards.",
  "how_to_use_profile_section": "Profile Section",
  "how_to_use_profile_section_list": [
    "View your personal information",
    "Edit details when needed",
    "Update contact information"
  ],
  "how_to_use_loyalty_wallet": "Loyalty Wallet",
  "how_to_use_loyalty_wallet_list": [
    "Check your current points balance",
    "View points history and transactions",
    "Track earned and used points"
  ],
  "how_to_use_offers_vouchers": "Offers & Vouchers",
  "how_to_use_offers_vouchers_list": [
    "See active personalized offers",
    "View general offers available",
    "Access available vouchers"
  ],
  "how_to_use_earning_using_points": "Earning and Using Loyalty Points",
  "how_to_use_how_points_work": "How Points Work",
  "how_to_use_how_points_work_text": "Our loyalty program works on a simple principle: you earn points for every purchase you make, which can then be redeemed for valuable rewards.",
  "how_to_use_how_points_work_list": [
    "Default rate: €1 spent = 1 loyalty point earned",
    "Points are added to your account after purchases",
    "Points are tracked automatically in your wallet",
    "Points never expire as long as your account remains active"
  ],
  "how_to_use_redeeming_points": "Redeeming Points",
  "how_to_use_redeeming_points_text": "When you have enough points, you can exchange them for vouchers to use at our store.",
  "how_to_use_redeeming_points_list": [
    "Check your points balance in the dashboard",
    "Contact our staff for point redemption",
    "Admin converts points to unique voucher code",
    "Use voucher code at checkout to get discount"
  ],
  "how_to_use_managing_your_account": "Managing Your Account",
  "how_to_use_updating_information": "Updating Information",
  "how_to_use_updating_information_text": "Keep your information up-to-date to receive personalized offers and communications.",
  "how_to_use_updating_information_list": [
    "Login to your account",
    "Navigate to \"Profile\" section",
    "Edit your personal information",
    "Save your changes"
  ],
  "how_to_use_communicating_with_us": "Communicating with Us",
  "how_to_use_communicating_with_us_text": "We may send you personalized offers, birthday messages, or important updates via WhatsApp.",
  "how_to_use_communicating_with_us_list": [
    "Ensure your phone number is current",
    "Check your messages regularly",
    "Opt-out anytime if you don't wish to receive updates"
  ],
  "how_to_use_faqs": "FAQs for Customers",
  "how_to_use_faq1_q": "How do I check my points balance?",
  "how_to_use_faq1_a": "Log in to your account and visit your dashboard to see your current points balance and history.",
  "how_to_use_faq2_q": "Do my points expire?",
  "how_to_use_faq2_a": "No, your points do not expire as long as your account remains active.",
  "how_to_use_faq3_q": "How do I redeem my points for rewards?",
  "how_to_use_faq3_a": "Contact our staff at the store, and they will help convert your points to a voucher code.",
  "how_to_use_faq4_q": "What if I forget my password?",
  "how_to_use_faq4_a": "Use the 'Forgot Password' link on the login page to reset your password via email.",
  "how_to_use_back_to_home": "Back to Home",
  "auth_welcome_back": "Welcome Back",
  "auth_sign_in_to_account": "Sign in to your account",
  "auth_email_address": "Email address",
  "auth_password": "Password",
  "auth_sign_in": "Sign in",
  "auth_signing_in": "Signing in...",
  "auth_magic_link": "Sign in with Magic Link",
  "auth_magic_link_sent": "Magic link sent! Check your email.",
  "auth_no_account": "Don't have an account?",
  "auth_register": "Register",
  "auth_personal_information": "Personal Information",
  "auth_start_with_name": "Let's start with your name",
  "auth_first_name": "First Name",
  "auth_last_name": "Last Name",
  "auth_date_of_birth": "Date of Birth",
  "auth_when_were_you_born": "When were you born?",
  "auth_residence": "Residence",
  "auth_where_do_you_live": "Where do you currently live?",
  "auth_city_address": "City / Address",
  "auth_contact_information": "Contact Information",
  "auth_how_can_we_reach_you": "How can we reach you?",
  "auth_phone_number": "Phone Number",
  "auth_security": "Security",
  "auth_secure_your_account": "Secure your account",
  "auth_password_placeholder": "At least 8 characters",
  "auth_confirm_password": "Confirm Password",
  "auth_confirm_password_placeholder": "Confirm your password",
  "auth_country_of_origin": "Country of Origin",
  "auth_where_are_you_from": "Where are you from?",
  "auth_language_preference": "Language Preference",
  "auth_which_language": "Which language do you prefer?",
  "auth_privacy_policy": "Privacy Policy",
  "auth_privacy_policy_consent": "We need your consent to process your data",
  "auth_i_agree_privacy": "I agree to the",
  "auth_terms_and_conditions": "Terms & Conditions",
  "auth_terms_and_conditions_consent": "Please confirm you agree to our terms",
  "auth_i_accept_terms": "I accept the",
  "auth_review_submit": "Review & Submit",
  "auth_review_your_information": "Please review your information before submitting",
  "auth_gdpr_consent": "GDPR Consent",
  "auth_agreed": "Agreed",
  "auth_not_agreed": "Not Agreed",
  "auth_complete_registration": "Complete Registration",
  "auth_processing": "Processing...",
  "auth_back": "Back",
  "auth_next": "Next",
  "auth_already_registered": "Already registered?",
  "auth_login_here": "Login here",
  "auth_need_help": "Need help?",
  "auth_contact_support": "Contact support",
  "auth_registration_complete": "Registration Complete!",
  "auth_confirmation_sent": "We've sent a confirmation link to",
  "auth_check_your_email": "Please check your email to verify your account.",
  "auth_got_it": "Got it",
  "auth_first_name_error": "First name is required",
  "auth_last_name_error": "Last name is required",
  "auth_dob_error": "Date of birth is required",
  "auth_residence_error": "Residence is required",
  "auth_phone_error": "Phone number is required",
  "auth_phone_error_invalid": "Please enter a valid phone number (digits, + - parentheses allowed).",
  "auth_email_error": "Email is required",
  "auth_email_error_invalid": "Please enter a valid email address.",
  "auth_password_error": "Password is required",
  "auth_password_error_length": "Password must be at least 8 characters long",
  "auth_password_confirmation_error": "Please confirm your password",
  "auth_password_confirmation_error_match": "Passwords do not match",
  "auth_country_error": "Country of origin is required",
  "auth_language_error": "Please select a language preference",
  "auth_privacy_error": "You must agree to the Privacy Policy",
  "auth_terms_error": "You must accept the Terms & Conditions",
  "auth_registration_failed": "Registration failed. Try again later."
}
