{
  "home": "Inicio",
  "about": "Sobre nosotros",
  "gallery": "Galería",
  "offers": "Ofertas",
  "reviews": "Reseñas",
  "contact": "Contacto",
  "login": "Iniciar sesión",
  "register": "Registrarse",
  "welcome": "Bienvenido a",
  "tagline": "Su negocio local de confianza que ofrece productos y servicios de calidad con una atención al cliente excepcional.",
  "view_products": "Ver nuestros productos",
  "contact_us": "Contáctenos",
  "about_us": "Sobre nosotros",
  "about_text": "En Baraka, nos comprometemos a ofrecer a nuestros clientes productos de la más alta calidad y un servicio excepcional. Ubicados en el corazón de Castel San Giovanni, llevamos años sirviendo a nuestra comunidad con dedicación y esmero. Nuestro equipo se enorgullece de ofrecer un servicio personalizado y de garantizar que cada cliente se vaya satisfecho.",
  "quality_products": "Productos de calidad",
  "quality_text": "Seleccionamos cuidadosamente cada producto para garantizar los más altos estándares.",
  "best_service": "El mejor servicio",
  "service_text": "Nuestro equipo se dedica a brindar una atención personalizada.",
  "customer_care": "Atención al cliente",
  "care_text": "Su satisfacción es nuestra máxima prioridad.",
  "visit_store": "Visite nuestra tienda",
  "address": "Nuestra dirección",
  "open_maps": "Abrir en Google Maps",
  "hours": "Horario de apertura",
  "our_gallery": "Nuestra galería",
  "view_all": "Ver todo",
  "special_offers": "Ofertas especiales",
  "weekly_offers": "Ofertas semanales",
  "permanent_offers": "Ofertas permanentes",
  "add_to_cart": "Añadir al carrito",
  "customer_reviews": "Reseñas de clientes",
  "load_more": "Cargar más reseñas",
  "get_in_touch": "Ponerse en contacto",
  "send_message": "Enviar mensaje",
  "name": "Nombre",
  "email": "Correo electrónico",
  "message": "Mensaje",
  "phone": "Teléfono",
  "quick_links": "Enlaces rápidos",
  "contact_info": "Información de contacto",
  "opening_hours": "Horario de apertura",
  "monday_friday": "Lunes - Viernes",
  "saturday": "Sábado",
  "sunday": "Domingo",
  "closed": "Cerrado",
  "privacy_policy": "Política de privacidad",
  "how_to_use": "Cómo utilizar",
  "cookie_policy": "Política de cookies",
  "terms_conditions": "Términos y condiciones",
  "dashboard_overview": "Resumen",
  "dashboard_profile": "Perfil",
  "dashboard_wallet": "Cartera de lealtad",
  "dashboard_offers": "Ofertas especiales",
  "dashboard_vouchers": "Mis cupones",
  "dashboard_loading": "Cargando panel...",
  "dashboard_title": "Panel de cliente",
  "dashboard_sign_out": "Cerrar sesión",
  "dashboard_welcome": "¡Bienvenido de nuevo! Aquí tienes un resumen de tu cuenta",
  "dashboard_profile_manage": "Administra tu información personal y tus preferencias",
  "dashboard_wallet_track": "Rastrea tus puntos de fidelidad y recompensas",
  "dashboard_offers_discover": "Descubre ofertas y promociones exclusivas",
  "dashboard_vouchers_manage": "Administra y canjea tus cupones",
  "privacy_title": "Política de privacidad",
  "privacy_last_updated": "Última actualización",
  "privacy_who_we_are_title": "Quiénes somos",
  "privacy_who_we_are_text": "Somos [Nombre legal de la empresa] (\"nosotros\", \"nos\", \"nuestro\"), registrados en [Dirección completa], número de empresa/impuestos [Número si corresponde]. Puede contactarnos en [correo electrónico de privacidad] o [teléfono], o por correo postal a la dirección anterior. Si se nombra, nuestro Delegado de Protección de Datos (DPD) puede ser contactado en [correo electrónico del DPD]. Si no estamos establecidos en la UE, nuestro Representante en la UE es [Nombre, Dirección, Correo electrónico].",
  "privacy_what_policy_covers_title": "Qué cubre esta política",
  "privacy_what_policy_covers_text": "Esta política explica cómo recopilamos, usamos, compartimos, almacenamos, protegemos y eliminamos sus datos personales cuando visita, se registra o utiliza [Nombre del servicio] (el \"Servicio\"), y describe sus derechos en virtud del RGPD.",
  "privacy_data_we_collect_title": "Los datos que recopilamos",
  "privacy_data_we_collect_list": [
    "<strong>Datos de identificación y contacto:</strong> nombre, apellido, correo electrónico, teléfono.",
    "<strong>Datos de la cuenta:</strong> contraseña (almacenada con hash), preferencias de idioma, configuración de la cuenta.",
    "<strong>Datos demográficos y de perfil:</strong> fecha de nacimiento, residencia, país de origen.",
    "<strong>Datos técnicos:</strong> dirección IP, identificadores de dispositivo, tipo de navegador, páginas visitadas y marcas de tiempo.",
    "<strong>Datos de cookies/SDK:</strong> cookies necesarias y, con consentimiento, de análisis/marketing. Consulte \"Cookies y tecnologías similares\".",
    "<strong>Datos opcionales</strong> que proporciona para soporte, encuestas o solicitudes de funciones."
  ],
  "privacy_data_we_collect_text": "No proporcione categorías especiales de datos (por ejemplo, salud, biométricos, opiniones políticas) a menos que se solicite específicamente y se justifique legalmente; de lo contrario, no los procesaremos a sabiendas.",
  "privacy_why_we_process_data_title": "Por qué procesamos sus datos",
  "privacy_why_we_process_data_text": "Procesamos datos personales solo cuando se aplica una base legal válida:",
  "privacy_why_we_process_data_list": [
    "<strong>Creación y administración de la cuenta:</strong> para registrarlo, autenticarlo y proporcionar el Servicio (contrato).",
    "<strong>Operación y seguridad del servicio:</strong> para operar, mantener, solucionar problemas, prevenir fraudes/abusos (intereses legítimos; cuando sea necesario, obligación legal).",
    "<strong>Comunicaciones:</strong> correos electrónicos de servicio sobre cambios, seguridad o avisos de cuenta (contrato/obligación legal); marketing opcional con su consentimiento y una opción de exclusión.",
    "<strong>Análisis y mejora:</strong> para comprender el uso, mejorar el rendimiento y las funciones (intereses legítimos; cookies de análisis solo con consentimiento).",
    "<strong>Cumplimiento:</strong> para cumplir con las obligaciones legales (impuestos, contabilidad, solicitudes regulatorias), hacer cumplir los términos, proteger los derechos."
  ],
  "privacy_why_we_process_data_text2": "Cuando nos basamos en intereses legítimos, equilibramos nuestros intereses con sus derechos y libertades y podemos proporcionar detalles a pedido. Puede oponerse al procesamiento basado en intereses legítimos.",
  "privacy_when_you_must_provide_data_title": "Si debe proporcionar datos",
  "privacy_when_you_must_provide_data_text": "Cuando los datos son necesarios para crear una cuenta o proporcionar el Servicio, no proporcionarlos puede impedir el registro o el acceso. Los campos obligatorios se marcan en el registro.",
  "privacy_who_receives_your_data_title": "Quién recibe sus datos",
  "privacy_who_receives_your_data_text": "Compartimos datos solo cuando es necesario:",
  "privacy_who_receives_your_data_list": [
    "<strong>Proveedores de servicios (procesadores):</strong> alojamiento, análisis, soporte al cliente, comunicaciones, pagos. Actúan según nuestras instrucciones y en virtud de acuerdos de protección de datos.",
    "<strong>Legal y cumplimiento:</strong> autoridades o terceros cuando lo exija la ley o para proteger los derechos y la seguridad.",
    "<strong>Transferencias comerciales:</strong> en una fusión, adquisición o venta de activos, sujeto a salvaguardas y notificación."
  ],
  "privacy_who_receives_your_data_text2": "No vendemos sus datos personales.",
  "privacy_international_data_transfers_title": "Transferencias internacionales de datos",
  "privacy_international_data_transfers_text": "Si transferimos sus datos fuera del EEE/Reino Unido, utilizamos salvaguardas aprobadas, como las decisiones de adecuación de la Comisión Europea o las Cláusulas contractuales estándar y, cuando sea necesario, medidas complementarias. Puede solicitar una copia de las salvaguardas pertinentes.",
  "privacy_data_retention_title": "Cuánto tiempo conservamos sus datos",
  "privacy_data_retention_text": "Conservamos los datos personales solo durante el tiempo necesario para los fines de esta política:",
  "privacy_data_retention_list": [
    "<strong>Datos de la cuenta:</strong> durante la vida de su cuenta y un período razonable a partir de entonces para el mantenimiento de registros, la seguridad y las obligaciones legales.",
    "<strong>Registros transaccionales/técnicos:</strong> durante períodos más cortos alineados con las necesidades de seguridad y auditoría."
  ],
  "privacy_data_retention_text2": "Aplicamos criterios como los períodos de limitación legal, los requisitos reglamentarios y las necesidades operativas. Cuando ya no son necesarios, eliminamos o anonimizamos irreversiblemente los datos.",
  "privacy_privacy_rights_title": "Sus derechos de privacidad",
  "privacy_privacy_rights_text": "En virtud del RGPD, usted tiene:",
  "privacy_privacy_rights_list": [
    "<strong>Derecho de acceso:</strong> obtener una copia de sus datos personales.",
    "<strong>Derecho de rectificación:</strong> corregir datos inexactos o incompletos.",
    "<strong>Derecho de supresión:</strong> solicitar la eliminación en ciertos casos (por ejemplo, retiro del consentimiento, ya no es necesario).",
    "<strong>Derecho a la restricción:</strong> limitar el procesamiento en circunstancias específicas.",
    "<strong>Derecho a la portabilidad:</strong> recibir sus datos en un formato legible por máquina y hacer que se transmitan a otro controlador cuando sea técnicamente factible.",
    "<strong>Derecho de oposición:</strong> oponerse al procesamiento basado en intereses legítimos o marketing directo.",
    "<strong>Derechos relacionados con la toma de decisiones automatizada:</strong> solicitar una revisión humana y oponerse a las decisiones cuando corresponda."
  ],
  "privacy_privacy_rights_text2": "Para ejercer estos derechos, contáctenos en [correo electrónico de privacidad]. Es posible que necesitemos verificar su identidad. También tiene derecho a presentar una queja ante su autoridad de control local.",
  "privacy_consent_withdrawal_title": "Consentimiento y retiro",
  "privacy_consent_withdrawal_text": "Cuando el procesamiento se basa en su consentimiento (por ejemplo, cookies de marketing o no esenciales), puede retirar el consentimiento en cualquier momento a través de la configuración de la cuenta, el banner de cookies, los enlaces para cancelar la suscripción o contactándonos, sin afectar el procesamiento antes del retiro.",
  "privacy_cookies_title": "Cookies y tecnologías similares",
  "privacy_cookies_text": "Nosotros usamos:",
  "privacy_cookies_list": [
    "<strong>Cookies estrictamente necesarias:</strong> necesarias para el inicio de sesión, la seguridad y las funciones principales (no se necesita consentimiento).",
    "<strong>Con su consentimiento:</strong> cookies de análisis y, si se utilizan, de marketing. Puede administrar las preferencias en el banner de cookies o en la configuración del navegador en cualquier momento."
  ],
  "privacy_cookies_text2": "Consulte nuestra Política de cookies para obtener detalles sobre las categorías, los fines, la vida útil y los proveedores.",
  "privacy_children_data_title": "Datos de niños",
  "privacy_children_data_text": "Nuestro Servicio no está dirigido a niños menores de la edad requerida por la ley local. Si nos enteramos de que procesamos los datos de un niño sin el consentimiento apropiado, los eliminaremos. Se aplican obligaciones adicionales de consentimiento parental para el consentimiento de los niños en algunas jurisdicciones.",
  "privacy_security_title": "Seguridad",
  "privacy_security_text": "Implementamos medidas técnicas y organizativas apropiadas para proteger los datos personales, incluido el cifrado en tránsito, los controles de acceso, las prácticas de desarrollo seguras y la diligencia debida del proveedor. Ningún sistema es 100% seguro; mantenemos y mejoramos las salvaguardas con el tiempo.",
  "privacy_automated_decision_making_title": "Toma de decisiones automatizada",
  "privacy_automated_decision_making_text": "No utilizamos la toma de decisiones automatizada que produzca efectos legales o significativamente similares sin las salvaguardas adecuadas. Si introducimos dicho procesamiento, proporcionaremos los avisos necesarios y habilitaremos sus derechos.",
  "privacy_third_party_sites_title": "Sitios de terceros",
  "privacy_third_party_sites_text": "El Servicio puede vincular a sitios web o servicios de terceros. Sus prácticas de privacidad se rigen por sus propias políticas; revíselas antes de proporcionar datos.",
  "privacy_changes_to_policy_title": "Cambios a esta política",
  "privacy_changes_to_policy_text": "Podemos actualizar esta política para reflejar los cambios en la ley, la tecnología o nuestras prácticas. Actualizaremos la fecha de \"Última actualización\" y, cuando sea necesario, proporcionaremos un aviso destacado o solicitaremos un consentimiento renovado.",
  "privacy_contact_complaints_title": "Contacto y quejas",
  "privacy_contact_complaints_text": "Preguntas o solicitudes: [correo electrónico de privacidad], [dirección postal], [teléfono]. Tiene derecho a presentar una queja ante una autoridad de protección de datos, como la autoridad en su residencia habitual, lugar de trabajo o lugar de la presunta infracción."
}
