{
  "home": "Accueil",
  "about": "À propos",
  "gallery": "Galerie",
  "offers": "Offres",
  "reviews": "Avis",
  "contact": "Contact",
  "login": "Connexion",
  "register": "S'inscrire",
  "welcome": "Bienvenue à",
  "tagline": "Votre entreprise locale de confiance offrant des produits et services de qualité avec un service client exceptionnel.",
  "view_products": "Voir nos produits",
  "contact_us": "Nous contacter",
  "about_us": "À propos de nous",
  "about_text": "Chez Baraka, nous nous engageons à fournir à nos clients des produits de la plus haute qualité et un service exceptionnel. Situés au cœur de Castel San Giovanni, nous servons notre communauté depuis des années avec dévouement et soin. Notre équipe est fière d'offrir un service personnalisé et de veiller à ce que chaque client reparte satisfait.",
  "quality_products": "Produits de qualité",
  "quality_text": "Nous sélectionnons soigneusement chaque produit pour garantir les normes les plus élevées.",
  "best_service": "Meilleur service",
  "service_text": "Notre équipe se consacre à fournir une attention personnalisée.",
  "customer_care": "Service client",
  "care_text": "Votre satisfaction est notre priorité absolue.",
  "visit_store": "Visitez notre magasin",
  "address": "Notre adresse",
  "open_maps": "Ouvrir dans Google Maps",
  "hours": "Heures d'ouverture",
  "our_gallery": "Notre galerie",
  "view_all": "Voir tout",
  "special_offers": "Offres spéciales",
  "weekly_offers": "Offres hebdomadaires",
  "permanent_offers": "Offres permanentes",
  "add_to_cart": "Ajouter au panier",
  "customer_reviews": "Avis des clients",
  "load_more": "Charger plus d'avis",
  "get_in_touch": "Prendre contact",
  "send_message": "Envoyer le message",
  "name": "Nom",
  "email": "Email",
  "message": "Message",
  "phone": "Téléphone",
  "quick_links": "Liens rapides",
  "contact_info": "Coordonnées",
  "opening_hours": "Heures d'ouverture",
  "monday_friday": "Lundi - Vendredi",
  "saturday": "Samedi",
  "sunday": "Dimanche",
  "closed": "Fermé",
  "privacy_policy": "Politique de confidentialité",
  "how_to_use": "Comment utiliser",
  "cookie_policy": "Politique en matière de cookies",
  "terms_conditions": "Termes et conditions",
  "dashboard_overview": "Aperçu",
  "dashboard_profile": "Profil",
  "dashboard_wallet": "Portefeuille de fidélité",
  "dashboard_offers": "Offres spéciales",
  "dashboard_vouchers": "Mes bons",
  "dashboard_loading": "Chargement du tableau de bord...",
  "dashboard_title": "Tableau de bord client",
  "dashboard_sign_out": "Se déconnecter",
  "dashboard_welcome": "Content de vous revoir ! Voici un aperçu de votre compte",
  "dashboard_profile_manage": "Gérez vos informations personnelles et vos préférences",
  "dashboard_wallet_track": "Suivez vos points de fidélité et vos récompenses",
  "dashboard_offers_discover": "Découvrez des offres et des promotions exclusives",
  "dashboard_vouchers_manage": "Gérez et utilisez vos bons",
  "privacy_title": "Politique de confidentialité",
  "privacy_last_updated": "Dernière mise à jour",
  "privacy_who_we_are_title": "Qui sommes-nous",
  "privacy_who_we_are_text": "Nous sommes [Nom légal de la société] (\"nous\", \"nos\", \"notre\"), enregistrés à [Adresse complète], numéro d'entreprise/fiscal [Numéro le cas échéant]. Vous pouvez nous contacter à [email de confidentialité] ou [téléphone], ou par courrier à l'adresse ci-dessus. S'il est nommé, notre délégué à la protection des données (DPD) peut être contacté à [email du DPD]. Si nous ne sommes pas établis dans l'UE, notre représentant dans l'UE est [Nom, Adresse, Email].",
  "privacy_what_policy_covers_title": "Ce que cette politique couvre",
  "privacy_what_policy_covers_text": "Cette politique explique comment nous collectons, utilisons, partageons, stockons, sécurisons et supprimons vos données personnelles lorsque vous visitez, vous inscrivez ou utilisez [Nom du service] (le \"Service\"), et décrit vos droits en vertu du RGPD.",
  "privacy_data_we_collect_title": "Les données que nous collectons",
  "privacy_data_we_collect_list": [
    "<strong>Données d'identification et de contact :</strong> prénom, nom, email, téléphone.",
    "<strong>Données de compte :</strong> mot de passe (stocké haché), préférences linguistiques, paramètres du compte.",
    "<strong>Données démographiques et de profil :</strong> date de naissance, résidence, pays d'origine.",
    "<strong>Données techniques :</strong> adresse IP, identifiants d'appareil, type de navigateur, pages consultées et horodatages.",
    "<strong>Données de cookies/SDK :</strong> cookies nécessaires et, avec votre consentement, cookies d'analyse/marketing. Voir \"Cookies et technologies similaires\".",
    "<strong>Données facultatives</strong> que vous fournissez pour l'assistance, les enquêtes ou les demandes de fonctionnalités."
  ],
  "privacy_data_we_collect_text": "Ne fournissez pas de catégories particulières de données (par exemple, santé, biométrie, opinions politiques) sauf si cela est spécifiquement demandé et légalement justifié ; sinon, nous ne les traiterons pas sciemment.",
  "privacy_why_we_process_data_title": "Pourquoi nous traitons vos données",
  "privacy_why_we_process_data_text": "Nous traitons les données personnelles uniquement lorsqu'une base juridique valable s'applique :",
  "privacy_why_we_process_data_list": [
    "<strong>Création et administration de compte :</strong> pour vous inscrire, vous authentifier et fournir le Service (contrat).",
    "<strong>Fonctionnement et sécurité du service :</strong> pour exploiter, maintenir, dépanner, prévenir la fraude/l'abus (intérêts légitimes ; si nécessaire, obligation légale).",
    "<strong>Communications :</strong> e-mails de service concernant les modifications, la sécurité ou les avis de compte (contrat/obligation légale) ; marketing facultatif avec votre consentement et une option de désinscription.",
    "<strong>Analyse et amélioration :</strong> pour comprendre l'utilisation, améliorer les performances et les fonctionnalités (intérêts légitimes ; cookies d'analyse uniquement avec votre consentement).",
    "<strong>Conformité :</strong> pour respecter les obligations légales (fiscales, comptables, demandes réglementaires), faire respecter les conditions, protéger les droits."
  ],
  "privacy_why_we_process_data_text2": "Lorsque nous nous appuyons sur des intérêts légitimes, nous équilibrons nos intérêts par rapport à vos droits et libertés et pouvons fournir des détails sur demande. Vous pouvez vous opposer au traitement fondé sur des intérêts légitimes.",
  "privacy_when_you_must_provide_data_title": "Si vous devez fournir des données",
  "privacy_when_you_must_provide_data_text": "Lorsque les données sont nécessaires pour créer un compte ou fournir le Service, le fait de ne pas les fournir peut empêcher l'inscription ou l'accès. Les champs obligatoires sont marqués lors de l'inscription.",
  "privacy_who_receives_your_data_title": "Qui reçoit vos données",
  "privacy_who_receives_your_data_text": "Nous ne partageons les données que lorsque cela est nécessaire :",
  "privacy_who_receives_your_data_list": [
    "<strong>Fournisseurs de services (sous-traitants) :</strong> hébergement, analyse, support client, communications, paiements. Ils agissent selon nos instructions et en vertu d'accords de protection des données.",
    "<strong>Juridique et conformité :</strong> autorités ou tiers lorsque la loi l'exige ou pour protéger les droits et la sécurité.",
    "<strong>Transferts d'entreprise :</strong> en cas de fusion, d'acquisition ou de vente d'actifs, sous réserve de garanties et de notification."
  ],
  "privacy_who_receives_your_data_text2": "Nous ne vendons pas vos données personnelles.",
  "privacy_international_data_transfers_title": "Transferts internationaux de données",
  "privacy_international_data_transfers_text": "Si nous transférons vos données en dehors de l'EEE/Royaume-Uni, nous utilisons des garanties approuvées telles que les décisions d'adéquation de la Commission européenne ou les clauses contractuelles types, et, si nécessaire, des mesures supplémentaires. Vous pouvez demander une copie des garanties pertinentes.",
  "privacy_data_retention_title": "Combien de temps nous conservons vos données",
  "privacy_data_retention_text": "Nous ne conservons les données personnelles que le temps nécessaire aux fins énoncées dans cette politique :",
  "privacy_data_retention_list": [
    "<strong>Données de compte :</strong> pendant la durée de vie de votre compte et une période raisonnable par la suite pour la tenue de registres, la sécurité et les obligations légales.",
    "<strong>Journaux transactionnels/techniques :</strong> pour des périodes plus courtes alignées sur les besoins de sécurité et d'audit."
  ],
  "privacy_data_retention_text2": "Nous appliquons des critères tels que les délais de prescription légaux, les exigences réglementaires et les besoins opérationnels. Lorsqu'elles ne sont plus nécessaires, nous supprimons ou anonymisons de manière irréversible les données.",
  "privacy_privacy_rights_title": "Vos droits en matière de confidentialité",
  "privacy_privacy_rights_text": "En vertu du RGPD, vous avez :",
  "privacy_privacy_rights_list": [
    "<strong>Droit d'accès :</strong> obtenir une copie de vos données personnelles.",
    "<strong>Droit de rectification :</strong> corriger les données inexactes ou incomplètes.",
    "<strong>Droit à l'effacement :</strong> demander la suppression dans certains cas (par exemple, retrait du consentement, plus nécessaire).",
    "<strong>Droit à la limitation :</strong> limiter le traitement dans des circonstances spécifiques.",
    "<strong>Droit à la portabilité :</strong> recevoir vos données dans un format lisible par machine et les faire transmettre à un autre responsable du traitement lorsque cela est techniquement possible.",
    "<strong>Droit d'opposition :</strong> s'opposer au traitement fondé sur des intérêts légitimes ou à des fins de marketing direct.",
    "<strong>Droits liés à la prise de décision automatisée :</strong> demander un examen humain et contester les décisions le cas échéant."
  ],
  "privacy_privacy_rights_text2": "Pour exercer ces droits, contactez-nous à [email de confidentialité]. Nous pouvons avoir besoin de vérifier votre identité. Vous avez également le droit de déposer une plainte auprès de votre autorité de contrôle locale.",
  "privacy_consent_withdrawal_title": "Consentement et retrait",
  "privacy_consent_withdrawal_text": "Lorsque le traitement repose sur votre consentement (par exemple, les cookies marketing ou non essentiels), vous pouvez retirer votre consentement à tout moment via les paramètres du compte, la bannière de cookies, les liens de désinscription ou en nous contactant, sans affecter le traitement avant le retrait.",
  "privacy_cookies_title": "Cookies et technologies similaires",
  "privacy_cookies_text": "Nous utilisons :",
  "privacy_cookies_list": [
    "<strong>Cookies strictement nécessaires :</strong> requis pour la connexion, la sécurité et les fonctions de base (aucun consentement requis).",
    "<strong>Avec votre consentement :</strong> cookies d'analyse et, le cas échéant, de marketing. Vous pouvez gérer vos préférences dans la bannière de cookies ou les paramètres du navigateur à tout moment."
  ],
  "privacy_cookies_text2": "Consultez notre politique en matière de cookies pour plus de détails sur les catégories, les objectifs, la durée de vie et les fournisseurs.",
  "privacy_children_data_title": "Données des enfants",
  "privacy_children_data_text": "Notre Service n'est pas destiné aux enfants n'ayant pas l'âge requis par la loi locale. Si nous apprenons que nous avons traité les données d'un enfant sans le consentement approprié, nous les supprimerons. Des obligations supplémentaires de consentement parental s'appliquent pour le consentement des enfants dans certaines juridictions.",
  "privacy_security_title": "Sécurité",
  "privacy_security_text": "Nous mettons en œuvre des mesures techniques et organisationnelles appropriées pour protéger les données personnelles, notamment le cryptage en transit, les contrôles d'accès, les pratiques de développement sécurisées et la diligence raisonnable des fournisseurs. Aucun système n'est sécurisé à 100 % ; nous maintenons et améliorons les garanties au fil du temps.",
  "privacy_automated_decision_making_title": "Prise de décision automatisée",
  "privacy_automated_decision_making_text": "Nous n'utilisons pas de prise de décision automatisée qui produit des effets juridiques ou similaires sans garanties appropriées. Si nous introduisons un tel traitement, nous fournirons les avis requis et activerons vos droits.",
  "privacy_third_party_sites_title": "Sites tiers",
  "privacy_third_party_sites_text": "Le Service peut contenir des liens vers des sites Web ou des services tiers. Leurs pratiques en matière de confidentialité sont régies par leurs propres politiques ; consultez-les avant de fournir des données.",
  "privacy_changes_to_policy_title": "Modifications de cette politique",
  "privacy_changes_to_policy_text": "Nous pouvons mettre à jour cette politique pour refléter les modifications de la loi, de la technologie ou de nos pratiques. Nous mettrons à jour la date de « Dernière mise à jour » et, le cas échéant, fournirons un avis visible ou demanderons un consentement renouvelé.",
  "privacy_contact_complaints_title": "Contact et réclamations",
  "privacy_contact_complaints_text": "Questions ou demandes : [email de confidentialité], [adresse postale], [téléphone]. Vous avez le droit de déposer une plainte auprès d'une autorité de protection des données, telle que l'autorité de votre lieu de résidence habituel, de votre lieu de travail ou du lieu de l'infraction présumée."
}
