{
  "home": "Home",
  "about": "Chi siamo",
  "gallery": "Galleria",
  "offers": "Offerte",
  "reviews": "Recensioni",
  "contact": "Contatti",
  "login": "Accesso",
  "register": "Registrati",
  "welcome": "Benvenuti a",
  "tagline": "La vostra azienda locale di fiducia che offre prodotti e servizi di qualità con un'assistenza clienti eccezionale.",
  "view_products": "Guarda i nostri prodotti",
  "contact_us": "Contattaci",
  "about_us": "Chi siamo",
  "about_text": "Da Baraka, ci impegniamo a fornire ai nostri clienti prodotti di altissima qualità e un servizio eccezionale. Situati nel cuore di Castel San Giovanni, serviamo la nostra comunità da anni con dedizione e cura. Il nostro team è orgoglioso di offrire un servizio personalizzato e di garantire che ogni cliente se ne vada soddisfatto.",
  "quality_products": "Prodotti di qualità",
  "quality_text": "Selezioniamo attentamente ogni prodotto per garantire i più alti standard.",
  "best_service": "Miglior servizio",
  "service_text": "Il nostro team è dedicato a fornire un'attenzione personalizzata.",
  "customer_care": "Assistenza clienti",
  "care_text": "La vostra soddisfazione è la nostra massima priorità.",
  "visit_store": "Visita il nostro negozio",
  "address": "Il nostro indirizzo",
  "open_maps": "Apri in Google Maps",
  "hours": "Orari di apertura",
  "our_gallery": "La nostra galleria",
  "view_all": "Vedi tutto",
  "special_offers": "Offerte speciali",
  "weekly_offers": "Offerte settimanali",
  "permanent_offers": "Offerte permanenti",
  "add_to_cart": "Aggiungi al carrello",
  "customer_reviews": "Recensioni dei clienti",
  "load_more": "Carica altre recensioni",
  "get_in_touch": "Mettiti in contatto",
  "send_message": "Invia messaggio",
  "name": "Nome",
  "email": "Email",
  "message": "Messaggio",
  "phone": "Telefono",
  "quick_links": "Link rapidi",
  "contact_info": "Informazioni di contatto",
  "opening_hours": "Orari di apertura",
  "monday_friday": "Lunedì - Venerdì",
  "saturday": "Sabato",
  "sunday": "Domenica",
  "closed": "Chiuso",
  "privacy_policy": "Informativa sulla privacy",
  "how_to_use": "Come si usa",
  "cookie_policy": "Politica sui cookie",
  "terms_conditions": "Termini e condizioni",
  "dashboard_overview": "Panoramica",
  "dashboard_profile": "Profilo",
  "dashboard_wallet": "Portafoglio fedeltà",
  "dashboard_offers": "Offerte speciali",
  "dashboard_vouchers": "I miei voucher",
  "dashboard_loading": "Caricamento dashboard...",
  "dashboard_title": "Dashboard cliente",
  "dashboard_sign_out": "Esci",
  "dashboard_welcome": "Bentornato! Ecco una panoramica del tuo account",
  "dashboard_profile_manage": "Gestisci le tue informazioni personali e le tue preferenze",
  "dashboard_wallet_track": "Tieni traccia dei tuoi punti fedeltà e dei tuoi premi",
  "dashboard_offers_discover": "Scopri offerte e promozioni esclusive",
  "dashboard_vouchers_manage": "Gestisci e riscatta i tuoi voucher",
  "privacy_title": "Informativa sulla privacy",
  "privacy_last_updated": "Ultimo aggiornamento",
  "privacy_who_we_are_title": "Chi siamo",
  "privacy_who_we_are_text": "Siamo [Nome legale della società] (\"noi\", \"ci\", \"nostro\"), registrati a [Indirizzo completo], numero di società/partita IVA [Numero se applicabile]. Puoi contattarci a [email sulla privacy] o [telefono], o per posta all'indirizzo sopra indicato. Se nominato, il nostro responsabile della protezione dei dati (DPO) può essere contattato a [email del DPO]. Se non siamo stabiliti nell'UE, il nostro rappresentante nell'UE è [Nome, Indirizzo, Email].",
  "privacy_what_policy_covers_title": "Cosa copre questa informativa",
  "privacy_what_policy_covers_text": "Questa informativa spiega come raccogliamo, utilizziamo, condividiamo, archiviamo, proteggiamo ed eliminiamo i tuoi dati personali quando visiti, ti registri o utilizzi [Nome del servizio] (il \"Servizio\") e descrive i tuoi diritti ai sensi del GDPR.",
  "privacy_data_we_collect_title": "I dati che raccogliamo",
  "privacy_data_we_collect_list": [
    "<strong>Dati di identificazione e contatto:</strong> nome, cognome, email, telefono.",
    "<strong>Dati dell'account:</strong> password (memorizzata con hash), preferenze di lingua, impostazioni dell'account.",
    "<strong>Dati demografici e del profilo:</strong> data di nascita, residenza, paese di origine.",
    "<strong>Dati tecnici:</strong> indirizzo IP, identificatori del dispositivo, tipo di browser, pagine visualizzate e timestamp.",
    "<strong>Dati dei cookie/SDK:</strong> cookie necessari e, con il consenso, cookie di analisi/marketing. Vedi \"Cookie e tecnologie simili\".",
    "<strong>Dati facoltativi</strong> che fornisci per supporto, sondaggi o richieste di funzionalità."
  ],
  "privacy_data_we_collect_text": "Non fornire categorie speciali di dati (ad es. salute, dati biometrici, opinioni politiche) se non specificamente richiesto e legalmente giustificato; altrimenti non li elaboreremo consapevolmente.",
  "privacy_why_we_process_data_title": "Perché trattiamo i tuoi dati",
  "privacy_why_we_process_data_text": "Trattiamo i dati personali solo laddove si applichi una base giuridica valida:",
  "privacy_why_we_process_data_list": [
    "<strong>Creazione e amministrazione dell'account:</strong> per registrarti, autenticarti e fornire il Servizio (contratto).",
    "<strong>Funzionamento e sicurezza del servizio:</strong> per operare, mantenere, risolvere problemi, prevenire frodi/abusi (interessi legittimi; ove necessario, obbligo legale).",
    "<strong>Comunicazioni:</strong> email di servizio su modifiche, sicurezza o avvisi sull'account (contratto/obbligo legale); marketing facoltativo con il tuo consenso e un'opzione di rinuncia.",
    "<strong>Analisi e miglioramento:</strong> per comprendere l'utilizzo, migliorare le prestazioni e le funzionalità (interessi legittimi; cookie di analisi solo con il consenso).",
    "<strong>Conformità:</strong> per adempiere agli obblighi legali (fiscali, contabili, richieste normative), far rispettare i termini, proteggere i diritti."
  ],
  "privacy_why_we_process_data_text2": "Laddove ci basiamo su interessi legittimi, bilanciamo i nostri interessi con i tuoi diritti e le tue libertà e possiamo fornire dettagli su richiesta. Puoi opporti al trattamento basato su interessi legittimi.",
  "privacy_when_you_must_provide_data_title": "Se devi fornire i dati",
  "privacy_when_you_must_provide_data_text": "Laddove i dati sono necessari per creare un account o fornire il Servizio, la mancata fornitura potrebbe impedire la registrazione o l'accesso. I campi obbligatori sono contrassegnati al momento della registrazione.",
  "privacy_who_receives_your_data_title": "Chi riceve i tuoi dati",
  "privacy_who_receives_your_data_text": "Condividiamo i dati solo se necessario:",
  "privacy_who_receives_your_data_list": [
    "<strong>Fornitori di servizi (responsabili del trattamento):</strong> hosting, analisi, assistenza clienti, comunicazioni, pagamenti. Agiscono secondo le nostre istruzioni e in base ad accordi sulla protezione dei dati.",
    "<strong>Legale e conformità:</strong> autorità o terze parti quando richiesto dalla legge o per proteggere i diritti e la sicurezza.",
    "<strong>Trasferimenti aziendali:</strong> in caso di fusione, acquisizione o vendita di beni, soggetti a garanzie e preavviso."
  ],
  "privacy_who_receives_your_data_text2": "Non vendiamo i tuoi dati personali.",
  "privacy_international_data_transfers_title": "Trasferimenti internazionali di dati",
  "privacy_international_data_transfers_text": "Se trasferiamo i tuoi dati al di fuori dello SEE/Regno Unito, utilizziamo garanzie approvate come le decisioni di adeguatezza della Commissione Europea o le Clausole Contrattuali Standard e, ove necessario, misure supplementari. Puoi richiedere una copia delle garanzie pertinenti.",
  "privacy_data_retention_title": "Per quanto tempo conserviamo i tuoi dati",
  "privacy_data_retention_text": "Conserviamo i dati personali solo per il tempo necessario per gli scopi indicati in questa informativa:",
  "privacy_data_retention_list": [
    "<strong>Dati dell'account:</strong> per la durata del tuo account e per un periodo ragionevole successivo per la tenuta dei registri, la sicurezza e gli obblighi legali.",
    "<strong>Registri transazionali/tecnici:</strong> per periodi più brevi in linea con le esigenze di sicurezza e di audit."
  ],
  "privacy_data_retention_text2": "Applichiamo criteri quali i periodi di prescrizione legale, i requisiti normativi e le esigenze operative. Quando non sono più necessari, eliminiamo o anonimizziamo irreversibilmente i dati.",
  "privacy_privacy_rights_title": "I tuoi diritti sulla privacy",
  "privacy_privacy_rights_text": "Ai sensi del GDPR, hai:",
  "privacy_privacy_rights_list": [
    "<strong>Diritto di accesso:</strong> ottenere una copia dei tuoi dati personali.",
    "<strong>Diritto di rettifica:</strong> correggere dati inesatti o incompleti.",
    "<strong>Diritto alla cancellazione:</strong> richiedere la cancellazione in determinati casi (ad es. revoca del consenso, non più necessari).",
    "<strong>Diritto di limitazione:</strong> limitare il trattamento in circostanze specifiche.",
    "<strong>Diritto alla portabilità:</strong> ricevere i tuoi dati in un formato leggibile da una macchina e farli trasmettere a un altro titolare del trattamento ove tecnicamente fattibile.",
    "<strong>Diritto di opposizione:</strong> opporti al trattamento basato su interessi legittimi o marketing diretto.",
    "<strong>Diritti relativi al processo decisionale automatizzato:</strong> richiedere una revisione umana e contestare le decisioni ove applicabile."
  ],
  "privacy_privacy_rights_text2": "Per esercitare questi diritti, contattaci a [email sulla privacy]. Potremmo aver bisogno di verificare la tua identità. Hai anche il diritto di presentare un reclamo alla tua autorità di controllo locale.",
  "privacy_consent_withdrawal_title": "Consenso e revoca",
  "privacy_consent_withdrawal_text": "Laddove il trattamento si basi sul tuo consenso (ad es. cookie di marketing o non essenziali), puoi revocare il consenso in qualsiasi momento tramite le impostazioni dell'account, il banner dei cookie, i link di annullamento dell'iscrizione o contattandoci, senza pregiudicare il trattamento prima della revoca.",
  "privacy_cookies_title": "Cookie e tecnologie simili",
  "privacy_cookies_text": "Utilizziamo:",
  "privacy_cookies_list": [
    "<strong>Cookie strettamente necessari:</strong> necessari per l'accesso, la sicurezza e le funzioni principali (nessun consenso richiesto).",
    "<strong>Con il tuo consenso:</strong> cookie di analisi e, se utilizzati, di marketing. Puoi gestire le preferenze nel banner dei cookie o nelle impostazioni del browser in qualsiasi momento."
  ],
  "privacy_cookies_text2": "Consulta la nostra Informativa sui cookie per i dettagli su categorie, scopi, durata e fornitori.",
  "privacy_children_data_title": "Dati dei minori",
  "privacy_children_data_text": "Il nostro Servizio non è rivolto a minori di età inferiore a quella richiesta dalla legge locale. Se veniamo a conoscenza di aver trattato i dati di un minore senza il consenso appropriato, li elimineremo. Obblighi aggiuntivi di consenso dei genitori si applicano per il consenso dei minori in alcune giurisdizioni.",
  "privacy_security_title": "Sicurezza",
  "privacy_security_text": "Implementiamo misure tecniche e organizzative appropriate per proteggere i dati personali, tra cui la crittografia in transito, i controlli degli accessi, le pratiche di sviluppo sicure e la due diligence dei fornitori. Nessun sistema è sicuro al 100%; manteniamo e miglioriamo le garanzie nel tempo.",
  "privacy_automated_decision_making_title": "Processo decisionale automatizzato",
  "privacy_automated_decision_making_text": "Non utilizziamo processi decisionali automatizzati che producono effetti legali o similmente significativi senza adeguate garanzie. Se introduciamo tale trattamento, forniremo le necessarie informative e abiliteremo i tuoi diritti.",
  "privacy_third_party_sites_title": "Siti di terze parti",
  "privacy_third_party_sites_text": "Il Servizio può contenere collegamenti a siti Web o servizi di terze parti. Le loro pratiche sulla privacy sono regolate dalle loro informative; consultale prima di fornire i dati.",
  "privacy_changes_to_policy_title": "Modifiche a questa informativa",
  "privacy_changes_to_policy_text": "Potremmo aggiornare questa informativa per riflettere le modifiche alla legge, alla tecnologia o alle nostre pratiche. Aggiorneremo la data di \"Ultimo aggiornamento\" e, ove richiesto, forniremo un avviso ben visibile o richiederemo un nuovo consenso.",
  "privacy_contact_complaints_title": "Contatti e reclami",
  "privacy_contact_complaints_text": "Domande o richieste: [email sulla privacy], [indirizzo postale], [telefono]. Hai il diritto di presentare un reclamo a un'autorità per la protezione dei dati, come l'autorità della tua residenza abituale, del luogo di lavoro o del luogo della presunta violazione."
}
